Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: དགེ་བའི་ཕྱོགས་ཡོངས་སུ་འདྲི་བར་བགྱིད་པའི་བར་དུ་ནན་ཏན་བགྱིད་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཕོ་བྲང་འཁོར་དང་། རི་བྲགས་དེ་རྣམས་མ་རུང་བར་བགྱིད་པར་སེམས་བསྐྱེད་པ་དང་། གང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པར་འགྱུར་བ་དེ་དག་ཏུ་ཐ་ན་སྐད་ཅིག་གཅིག་ཙམ་ཡང་འཐབ་པ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ལགས་པའི་རླུང་དང་། ཆར་དང་། གྲང་བ་དང་། ཚ་བ་དང་། ཆུ་བོ་དང་། ས་གཡོ་བ་དང་། ས་འགས་པ་དང་། སྐར་མདའ་ལྟུང་བར་བགྱིད་པ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། འབྲུ་དང་། སྨན་དང་། རོ་སྐྱེ་བར་མི་བགྱིད་དམ། མ་རུངས་པར་བགྱིད་པར་འཚལ་ན། བདུད་དེས་དེ་ལྟར་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བདུད་ནས་བདུད་ཀྱི་ཕོ་ཉའི་བར་དེ་དག་རིམས་ནད་ཀྱིས་ཚ་བར་འགྱུར།
en: Should they decide to endanger any village, town, city, country, capital, or border town; or should they desire to cause strife, discord, famine, disease, or foreign invasions, or untimely winds, rain, cold, or heat, or any flooding, earthquakes, fissures in the earth, or falling meteors in a place where this Dharma discourse is taught; or should they spoil the nutrients in leaves, flowers, fruit, grain, or herbs, then, as soon as they form that wish, I will ravage them with plagues.

source: ལུས་ལྕི་བ་དང་། རྔུལ་བ་དང་། ལུས་རུལ་བ་དང་། དྲི་མི་ཞིམ་པ་དང་། ལས་སུ་མི་རུང་བ་དང་ལྡང་མི་ནུས་པར་འགྱུར།
en: I will make their bodies heavy, dark, degenerate, stinky, inefficient, and unable to get up.

source: བཅིང་བ་ལྔས་བདག་བཅིངས་པར་མཐོང་བ་ནས། དེའི་ཡན་ལག་ཐམས་ཅད་འཁུམས་པའི་བར་དུ་འགྱུར་ཞིང་།
en: I will then tie them down with a fivefold noose and the like, until they are unable to move their limbs.

source: སླར་བརྐྱང་མི་ནུས་པ་དང་། དེའི་ཕྱོགས་ཐམས་ཅད་མུན་པར་གྱུར་ནས།
en: I will then bring darkness upon them such that they no longer can see the shining sun.

source: ཉི་མ་སྣང་བའི་གཟུགས་ཀྱང་མི་མཐོང་བ་དང་། དེའི་རྫུ་འཕྲུལ་བྲི་ནས་སེམས་འཁྲུག་པར་འགྱུར། དེའི་དབང་པོ་དྲུག་ཀྱང་སྤྱོད་ཡུལ་ལ་འཇུག་མི་ནུས་པར་འགྱུར་རོ།
en: Because of the loss of their magical powers, their minds will then become disturbed and their six sense faculties will be unable to apprehend objects.

source: །འདི་ལྟ་སྟེ། ཨ་མ་ལེ།
en: The dhāraṇī is:

source: ཨ་ཧ་མ་མ་ལེ། ཨ་ཛ་བ་བ། མཱུ་ར་ས་ལེ། བྱ་ཁ་ས་ལེ། ཛ་མ་ས་ལེ། ཧཱ་ཧཱ། ཧཱ་ཧཱ། ཧཱ་ཧཱ། གོ་ར་ས་ཌ་ཊ། ཛ་ན་ཁ་ག །ཛྙེ་ཡ་ཁ་ག །བིད་ཛྙེ་བ་ས་ཁ་ག །ཨ་མུ་ཀྵ་ར། ཀྵ་ཀྵ་ཀྵ། ཀྵ་ཀྵ་ཀྵ། མཱུ་ལ་བ་ཧ་ཁ་ག་སྦ། ཁད་ཉ་སྦ། བ་རི་བརྟ་མཱུར། ཨད་ཛྙཱ་ཛྙཱ། བ་ཡུ་ཛྙཱད་ཛྙཱ། ཙན་དྲ་སཱུ་རོ་ཛྙཱ་ཛྙཱ། ན་བ་ཧ་ཛྙཱད་ཛྙཱ། ཁུ་རཀྵ་ཛྙཱད་ཛྙཱ། བ་བ་ཛྙཱད་ཛྙཱ། བྷུ་ཏ་ཀོ་ཊི། ཏ་ཐ་ཏཱ་ཛྙཱད་ཛྙཱ། སརྦ་དེ་ཛྙེ་བི། ཨ་དྷི་ཥྛི་ཏ་ཛྙཱད་ཛྙཱ། བ་ཀྲ་མ། ཏྲི་ག་ཎ་ཏཱ་ཀྵ་བ་ཀྵ་མ་མ་ཀྵ་མ་ཛྙཱ་ཀྵ་བི་ཏ་མ་ར་བི་ཤཱ་ཡ་སྭཱ་ཧཱ།
en: amale ahaṃ male ahaṃ male ajavava ajavava mūlasare vyākhasale jamasale haha haha haha ghora­saṭṭa jatakhaga jñeyakhaga vijñevāsakhaga amūkṣara kṣakṣakṣa kṣakṣakṣa mūlabaha khagasvakajña sva­parivartamūra ajñajña vāyujñajña candra­sūryau­jñajña nāvaha­jñajña khurakṣa­jñajña baba­jñajña bhūta­koṭi­tathatā­jñajña sarva­jñebhir adhiṣṭhita­jñajña vakrama trigata­kṣava kṣamama­kṣama­jña kṣitā­māra­viṣaya svāhā!”

source: ཐམས་ཅད་མཁྱེན་པ་རྣམས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་སྐད་ཅིག་ཏུ་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་མེད་པར་བྱས་ཏེ་འབྲས་བུ་མེད་པར་གྱུར་ཏོ།
en: By the blessing of the omniscient ones, the ephemeral dominions of Māra faded away and became ineffective.

source: །གང་སུ་ཡང་རུང་གནོད་པར་འདོད་པ་དག་ཀྱང་དེ་བཞིན་ནོ།
en: The same happened to all those who harbored ill will.

source: །དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན་ནོ།
en: All the blessed buddhas applauded Kautūhalika, and so did all the bodhisattva great beings, the gods, and the other human and nonhuman beings.

source: །དེ་ནས་དེའི་ཚེ་ས་ནི་གཡོས། སྤྲིན་ནི་འཁྲུགས། །རིའི་རྒྱལ་པོ་རྣམས་ནི་རབ་ཏུ་གཡོས་ཏེ།
en: Simultaneously, the earth in that area trembled, the waters were stirred, and the kings of mountains quaked.

source: གང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་དད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པ་རྣམས་མ་གཏོགས་པར་བདུད་འཁོར་དང་བཅས་པ་དང་། དེ་བཞིན་དུ་འབྱུང་པོ་མ་རུངས་པ་རྣམས་ཀྱང་འཁྲུགས་སོ།
en: Except for those who had faith in the Buddha’s teachings and the bodhisattvas among them who had attained acceptance, Māra , his retinue, and the kaṭapūtanas were shaken.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྲ་བའི་བློ་གྲོས་ལ་སྨྲས་པ། རིགས་ཀྱི་བུ་བདུད་རི་བྱི་འདིའི་སྟོབས་ག་ལས་འོང་།
en: Māra , the evil one, inquired of the bodhisattva Dṛḍhamati, “O noble son, where has the power of the māra Agasti gone?

source: མཐུ་ག་ལས་འོངས་ན། གང་སྙིང་རྗེ་མེད་པ་འདིས་རང་གི་ཕྱོགས་ཐམས་ཅད་དང་། ངའི་སྟོབས་ཀྱི་ཡུལ་དང་། ཕ་རོལ་གནོན་པ་ཐམས་ཅད་མ་ལུས་པར་བཅོམ་སྟེ། ནག་པོའི་རྩ་ལག་ནི་ཕམ་པར་བྱས། མི་འཐུན་པ་ཆད་པར་སྨྲ་བ་དང་། དགེ་སྦྱོང་གཽ་ཏ་མའི་ཕྱོགས་ནི་མཐོ་བར་བྱས།
en: And where is his might, if, because of the cruel Buddha, his own followers and also the power and valor of my own realm have been destroyed, the dark factions have been defeated, and the followers of the monk Gautama who preaches the extreme form of nihilism have been elevated?

source: བདག་ཀྱང་གཟུངས་འདི་ཐོས་མ་ཐག་ཏུ་ལུས་དྲི་མི་ཞིམ་པ་དང་། ལུས་རུལ་བ་དང་། ལས་སུ་མི་རུང་བར་གྱུར།
en: I myself, after hearing that dhāraṇī, have become stinky and sweaty and unable to act.

source: བདག་གི་ཕྱོགས་ཐམས་ཅད་ཀྱང་མུན་པར་གྱུར་ཏེ་སྣང་ཞིང་མཐོང་བ་མེད་པར་བྱས་ནས།
en: It has grown dark for me in all directions, and I can’t see the light.

source: ཡོངས་སུ་གདུང་བ་ཆེན་པོས་ཀྱང་བདག་གདུངས་སོ།
en: I am burning with great anguish.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སྲ་བའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། སྡིག་ཅན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་དང་། མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱི་སྟོབས་བསྐྱེད་པས།
en: “The māra Agasti, O evil one, has brought about the ruin of the entire realm of Māra , along with its power and valor,” replied the bodhisattva Dṛḍhamati.

source: བདུད་རི་བྱིས་བདུད་ཀྱི་སྟོབས་ཀྱི་ཡུལ་དང་། ཕ་རོལ་གནོན་པ་འདིར་ཐམས་ཅད་རྣམ་པར་འཇོམས་ཤིང་།
en: “This transpired through the blessing of all the buddhas, involving the power of all human and nonhuman beings. He pronounced this dhāraṇī with its mantra words that cannot be conquered by others.

source: དེས་གཞན་གྱིས་མི་ཚུགས་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་ཀྱང་བཤད་ཀྱིས་སྡིག་ཅན་ཁྱོད་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དད་པར་གྱིས་ཤིག །ཅི་ནས་ཁྱོད་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྡུག་བསྔལ་འདི་དག་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་སེམས་བསྐྱེད་ཅིག །བདུད་སྡིག་ཅན་གྱིས་སྨྲས་པ།
en: So please, evil one, be inspired with faith in the presence of the thus-gone ones and develop the mind directed toward unsurpassed and perfect awakening, so that you may be freed from the suffering of your body, speech, and mind.”

source: བདག་ནི་ཕྱི་མའི་མཐའི་མུ་གྲངས་མེད་པར་འདི་བས་ཀྱང་ཆེས་སྡིག་པའི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྡུག་བསྔལ་རྣམས་ལ་སྤྲོའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ནི་བདག་སེམས་མི་བསྐྱེད་དོ།
en: Māra , the evil one, retorted, “I would rather endure worse suffering of my evil body, speech, and mind than this, far into the unreckonable future, than to develop the mind directed toward unsurpassed and perfect awakening.”

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། དམ་པའི་ཆོས་ཀྱི་ཚུལ་བསྲུང་བའི་ལེའུ་སྟེ། བཅུ་གཅིག་པའོ།།
en: This concludes the eleventh chapter on protecting the methods of the sacred Dharma in the “ Ratnaketu ” section of the Great Collection of Mahāyāna sūtras.

source: །།དེ་ནས་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་ནི། གནོད་སྦྱིན་འཇིགས་འཇིགས་ལྟ་བུའི་གཟུགས་སུ། ཡང་དག་ཤེས་ནི་རི་དགས་ཀྱི་གཟུགས་སུ། ཤེས་པའི་སྒྲོན་མ་ནི་སྤྲེའུའི་གཟུགས་སུ། སྲེད་སྤོང་ནི་རའི་གཟུགས་སུ། རྒྱུན་བཅད་པ་ནི་གླང་པོ་ཆེའི་གཟུགས་སུ། སེམས་ཅན་ཆེན་པོ་ལྔ་པོ་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་དྲུང་ནས། ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན།
en: The great general of the yakṣas, Āṭavaka, in the form of the yakṣa Bhīṣaṇaka, and Saṃjñika in the form of a deer, Jñānolka in the form of a monkey, Tṛṣṇājaha in the form of a jackal, and Chinnasrotas in the form of an elephant—these five great beings—were sitting not too far from the thus-gone Śākyamuni and in front of the thus-gone Kauṇḍiṇyārcis.

source: དེ་བཞིན་གཤེགས་པ་ཀཽཎྜི་ནྱ་འོད་འཕྲོ་བའི་སྤྱན་སྔར་འཁོད་ནས་དེ་དག་གི་ལུས་ཐམས་ཅད་ལས་རྣམ་པར་དག་ཅིང་། དྲི་ཞིམ་པའི་འོད་ཕྱུང་ངོ་།
en: From each of their bodies a pure light radiated, suffused with fragrance.

source: །དེ་ནས་སེམས་ཅན་ཆེན་པོ་ལྔ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་མེའི་འོད་ཅེས་བྱ་བ་ལག་པ་གཉིས་ན་ཐོགས་སོ།
en: Each of these five great beings was holding in his hands a great precious gem called Starlight for the sake of worshipping the Blessed One.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྟད་མོ་ཅན་གྱིས་དེ་དག་གིས་བསམ་པ་ཚུལ་བཞིན་རྣམ་པར་དག་པ་ལ་བལྟས་ཏེ།
en: The bodhisattva Kautūhalika saw the profound purity of their hearts and minds.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའོ་སྙམ་ནས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་དེ་ལ་བོས་ཏེ།
en: Thinking that they must be bodhisattva great beings, he addressed the great yakṣa general, Āṭavaka:

source: འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་སྐྱེས་བུ་དམ་པ་དོན་གྱི་དབང་གང་མཐོང་ན་ཁྱེད་འདི་ལྟ་བུའི་སྤྱོད་ལམ་གྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད།
en: “What purpose, O good man, do you see in your endeavor to worship the blessed buddhas through acting the way you do?”

source: འབྲོག་གནས་ཀྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ན། སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དེ་བཞིན་གཤེས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་བྱུང་ངོ་།
en: Āṭavaka replied, “Formerly, O noble son, ninety eons ago, there was a thus-gone, worthy, perfect buddha named Vipaśyin in this buddha field.

source: །དེའི་ཚེ་བདག་ཅག་ལྔ་སྤུན་དྲུང་དུ་གྱུར་ཏེ།
en: At that time, the five of us were blood brothers.

source: དེ་ན་བདག་ཅག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ནན་ཏན་བྱས་སོ།
en: Once we developed the mind directed toward unsurpassed and perfect awakening, we earnestly applied ourselves to bringing beings to maturity.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གཙུག་ཏོར་ཅན་དང་། ཐམས་ཅད་སྐྱོབ་དང་། བསྐལ་པ་ཆེན་པོ་བཟང་པོ་འདི་བྱུང་མ་ཐག་ཏུ་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་འཇིག་རྟེན་དུ་བྱུང་གི་བར་དུ་དེ་ན་ཡང་དེ་བཞིན་དུ་བདག་ཅག་སྔོན་གྱི་སྨོན་ལམ་གྱིས་སྤུན་དྲུང་དུ་གྱུར་ཏེ།
en: Later, following the time of the thus-gone Śikhin, the time of the thus-gone Viśvabhū, and right at the beginning of the Fortunate Eon when the thus-gone Kakutsunda came to this world, we were again reborn as brothers because of our previous aspirations.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་བདག་ཅག་གིས་མཆོད་པ་དང་། བསྙེན་བཀུར་རྣམ་པ་མང་པོ་བྱས་སོ།
en: We worshiped and served the thus-gone Kakutsunda a great deal.

source: །དེ་ནས་ཡང་དེར་སེམས་ཅན་ཆེན་པོ་དགེ་བསྙེན་ཡང་དག་ཤེས་བསམ་གཏན་ལ་མངོན་པར་དགའ་བས་དེར་འདི་འདྲ་བའི་སྨོན་ལམ་བཏབ་སྟེ།
en: During that time, the lay practitioner Saṃjñika, the great being who delighted in meditation, made the following great wish:

source: བདག་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་འདི་ལ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོར་གྱུར་ལ།
en: ‘I must become a great general of the yakṣas during the Fortunate Eon. I will give the appropriate Dharma instructions. I will give the appropriate Dharma instructions to the yakṣas, . . .

source: དེ་ན་འབྲོག་དགོན་པ་ན་གནས་པ་མ་རུངས་པ། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་དང་། སྙིང་བརྩེ་བ་མེད་པར་ཞུགས་པ། བྱད་གཟུགས་ཐ་དད་པའི་གནོད་སྦྱིན་དག་ནས་ལུས་སྲུལ་པོའི་བར་དུ་དེ་དག་ལ་བདག་གིས་འདི་འདྲ་བའི་ཆོས་བཤད་པར་བགྱི་སྟེ།
en: and the kaṭapūtanas who roam forests and wildernesses in various deformed shapes and who are wicked, cruel, and have no compassion for beings.

source: འདི་ལྟར་དད་པ་ཐོབ་པར་བྱས་ནས། བསླབ་པ་འཛིན་དུ་བཙུད་ལ་ཞི་བའི་ལམ་ལ་བཀོད་པ་ནས།
en: I will cause them to develop faith and embrace the training and will thus establish them on the auspicious path.

source: དེ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་རི་དགས་དང་། སྤྱང་ཀི་དང་། དགོ་བ་དང་། ཕག་ལ་སོགས་པ་ལ་ཡང་ཆོས་བཤད་པ་ནས་གནོད་སྦྱིན་མ་རུངས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བར་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་བར་ལ་ཆོས་བཤད་པས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས།
en: I will teach the Dharma also to those yakṣas born in animal forms such as deer, antelope, pigs, and so forth, until I have brought to maturity, by means of the Dharma instructions, as many wicked yakṣas as there are grains of sand in the Gaṅgā, including also those in animal forms that have not planted the roots of virtue.

source: ཐེག་པ་གསུམ་པོ་དག་ལ་སོ་སོར་བཀོད་དེ། དེ་ནས་གདོད་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་པར་ཤོག་ཤིག་ཅེས་བྱས་སོ།
en: I will thus establish them in the three vehicles, and after this I will obtain a prophecy with regard to my own unsurpassed and perfect awakening.’

source: །དེ་བཞིན་དུ་གནོད་སྦྱིན་ཤེས་པའི་སྒྲོན་མས་སྤྲེའུའི་གཟུགས་ཀྱིས་སྤྲེའུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་པོ།
en: “Similarly, the yakṣa Jñānolka, in the form of a monkey, made a wish to bring monkeys to maturity.

source: །སྲེད་སྤོང་རའི་གཟུགས་ཀྱིས་མི་ཁོམ་པས་ཉམ་ང་བར་གྱུར་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་པོ།
en: Tṛṣṇājaha, in the form of a jackal, made a wish to bring to maturity beings born into unfree conditions fraught with danger.

source: །རྒྱུན་བཅད་གླང་པོ་ཆེའི་གཟུགས་ཀྱིས་གླང་པོ་ཆེ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་སྟེ།
en: Chinnasrotas, in the form of an elephant, made a wish to bring elephants to maturity.

source: དེ་བཞིན་དུ་གནོད་སྦྱིན་རྫུ་འཕྲུལ་ཆེན་པོ་པ་གླིང་བཞི་པ་ན་གནས་པ་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཚོལ་ཞིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་རྣམ་པ་སྣ་ཚོགས་བཏབ་པར་གྱུར་ནས།
en: In this way, twelve thousand yakṣas of great power, who lived in this world of the four continents, variously made wishes to bring beings to maturity, as they themselves were seeking unsurpassed and perfect awakening.

source: བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་དེའི་སྤྱན་སྔར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཚོལ་ཞིང་བསྐལ་པ་བཟང་པོ་འདི་ཐམས་ཅད་དུ་གནོད་སྦྱིན་མ་རུངས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་བོ། །འདི་ན་གནོད་སྦྱིན་མ་རུངས་པ། སྙིང་རྗེ་མེད་པ། མི་གཟོ་བ།
en: “I, too, seeking unsurpassed and perfect awakening, made a wish in front of the thus-gone Kakutsunda to bring wicked yakṣas to maturity in this world, throughout the entire Fortunate Eon: “ ‘Come what may, I must induce the wicked yakṣas to train so that I can establish them on the path of no return—the wicked yakṣas who are cruel, ungrateful, dangerous, inclined toward evil, and devoid of compassion . . .

source: ཡ་ང་བ་སྤྱོད་པ། སྡིག་པ་འདོད་པ། སྙིང་རྗེ་དང་མི་ལྡན་པ་ནས་ལུས་སྲུལ་པོ་སེམས་ཅན་ལ་འཚེ་བ། མདངས་འཕྲོག་པ། སེམས་འཁྲུག་པར་བྱེད་པ།
en: and the kaṭapūtanas who harm beings, steal their energy, disturb their minds, inflame them with unwholesome thoughts, take their lives, . . .

source: མི་དགེ་བའི་སེམས་སུ་བྱེད་པ། སྲོག་གཅོད་པ་ནས་ལོག་པར་ལྟ་བའི་བར་དག་དང་ལྡན་པ།
en: and who harbor wrong views;

source: རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་ཀྱི་སེམས་འཁྲུག་པར་བྱེད་པ།
en: who disturb the minds of kṣatriyas, brahmins, vaiśyas, and śūdras;

source: ཡུལ་འཁོར་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་འཁྲུག་པར་བྱེད་པ།
en: who plague countries, villages, towns, cities, and other inhabited areas;

source: གཟའ་དང་། རྒྱུ་སྐར་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། ཉིན་པར་དང་། མཚན་མོ་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་པ་དང་། དུས་དང་། ལོ་འཁྲུག་པར་བྱེད་པ།
en: who upset the auspicious influence of planets, constellations, the moon, the sun, nights, days, months, fortnights, seasons, and years;

source: འཐབ་པ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་དང་། རབ་ཏུ་གྲང་བ་དང་། ཚ་བར་བྱེད་པ།
en: who spread discord, quarrels, famine, disease, invasions by foreign armies, untimely winds and rains, and extreme cold and heat;

source: ས་བོན་དང་། སྨན་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། རོ་མ་རུང་བར་བྱེད་པ།
en: who destroy seeds, herbs, leaves, flowers, fruits, and sap;

source: སེམས་ཅན་གྱི་བདེ་བ་དང་། ཡིད་བདེ་བ་དང་། ནད་མེད་པ་དང་། འདུམ་པ་དང་། དགེ་བའི་ཆོས་ལ་མོས་པ་དང་། སའི་བཅུད་དང་། མདངས་དང་། དོན་དང་། ཆོས་ཀྱི་རོ་དང་། རྣམ་པར་གྲོལ་བའི་རོ་ནུབ་པར་བྱེད་པ་རྣམས་བསླབ་པ་འཛིན་དུ་བཙུད་དེ། ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་ནས།
en: and who cause the disappearance of all the happiness, contentment, and good health of beings, as well as social harmony, the desire for positive qualities, earth essences, vital force, wealth, and the taste for the Dharma and liberation.

source: གང་ཚུན་ཆད་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་པ་དེ་ཚུན་ཆད་བདག་རྟག་ཏུ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་གྱི་ནང་དུ་སྐྱེས་ཏེ།
en: Later, I will obtain for myself a prophecy of unsurpassed and perfect awakening.’ “Ever since the time of making this vow, I have taken rebirth as a general of the wicked yakṣas, and brought the yakṣas . . .

source: གནོད་སྦྱིན་སྡིག་ཅན་ནས་ལུས་སྲུལ་པོའི་བར་དག་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་ནས།
en: and kaṭapūtanas to maturity by establishing them within the three vehicles, thus establishing them on the path of no return.

source: ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་ཅིང་དེ་ཚུན་ཆད་སེམས་ཅན་རབ་དང་འབྲིང་དང་། ཐ་མ་མཐོང་ཡང་བརྙས་པར་མི་དྲན་གྱི་སེམས་ཅན་ཅི་འདྲ་བ་མཐོང་བ་དེ་ཉིད་ཀྱི་ཚུལ་གྱིས་དེ་དག་ལ་སྨྲས། ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས། སྡིག་པ་ལས་བཟློག །བྱམས་པ་དང་། སྙིང་རྗེའི་སེམས་ལ་བཞག་སྟེ།
en: Ever since that time, when seeing beings of a lower, middling, or superior type, I do not allow myself to ignore their capacities, and whatever bodily form I see, I assume the same form to address them, converse with them, reinvigorate them, cheer them up, cause them to turn away from evil, and establish them in a loving and compassionate mindset.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐེག་པ་གསུམ་པོ་དག་ལ་ཕྱིར་མི་ལྡོག་པར་སོ་སོར་བཀོད་དོ། །བདག་གནོད་སྦྱིན་གྱི་འཁོར་གང་དང་། གང་དག་ཏུ་ཕྱིན་པ་དེ་དང་དེར་དེ་དག་གནོད་སྦྱིན་འབྲོག་གནས་བདེ་བར་འོངས་སམ། ཞེས་ཚིག་ཏུ་འབོད་དོ། །དེ་བས་ན་བདག་གི་མིང་འབྲོག་གནས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: According to their different inclinations, I establish them in the three vehicles, thus setting them on the path of no return. Whatever gathering of yakṣas I approach, I am greeted with the words, ‘Welcome to the forest-roaming yakṣa!’ Hence my name has become Āṭavaka, one who roams the woods.

source: །གང་དག་ད་ལྟར་ཆོས་རྙིང་པ་དང་བྲལ་ཞིང་སྡོམ་པ་ལ་མི་གནས་ཏེ། གཅིག་ཏུ་ལས་ནག་པོ་སྤྱོད་པའི་མི་དེ་དག་ནི་ཤི་བའི་དུས་བྱས་ནས། ངན་སོང་གསུམ་དུ་སྐྱེ་སྟེ།
en: “Humans who are presently deprived of the long-established Dharma, who do not practice restraint and who engage in singularly evil deeds, will plunge after death into one of the three lower realms.

source: མིའི་ནང་དུ་ནི་ཉུང་ཟད་ཅིག་སྐྱེའོ།
en: Few of them will be reborn as humans.

source: །གང་དག་ལས་འདྲེན་མར་སྤྱོད་ཅིང་། དཀོན་མཆོག་གསུམ་ལ་དད་པ་མ་ཐོབ་པ། དེ་དག་ནི་ཤི་བའི་དུས་བྱས་ནས་ཕལ་ཆེར་གནོད་སྦྱིན་སྡིག་ཅན་དང་། གནོད་སྦྱིན་ལུས་སྲུལ་པོའི་ནང་དུ་སྐྱེའོ།
en: Those who engage in mixed activities and have no faith in the Three Jewels will, for the most part, fall after death into the realm of the wicked yakṣas . . .

source: །དེ་བས་ན་ད་ལྟར་འཇིག་རྟེན་ན་གནོད་སྦྱིན་སྡིག་ཅན་ནས་གནོད་སྦྱིན་ལུས་སྲུལ་པོའི་བར་དུ་ཤིན་ཏུ་ཕལ་ཆེར་རྣམ་པར་འཕེལ་ཏེ།
en: and kaṭapūtanas. This is why, in this time, there is in this world such a proliferation of wicked yakṣas . . . and kaṭapūtanas.

source: དེ་དག་ཐམས་ཅད་ཀྱང་དཀར་པོའི་ཕྱོགས་ནུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པ་ཤ་སྟག་གོ།
en: All of them strive to make the white faction disappear.

source: །དེ་ལྟ་བས་ན་ད་ལྟར་ཤིན་ཏུ་དུས་ངན་པ་ལ་བབ་པས།
en: “For this reason, while the dark age is upon us, I am unable at this time to cause these wicked yakṣas . . . and kaṭapūtanas to develop the qualities of gentleness and kindness.

source: བདག་གིས་འཇམ་པོས་ནི། དུས་ཐམས་ཅད་དུ་གནོད་སྦྱིན་མ་རུངས་པ་ནས། ལུས་སྲུལ་པོ་མ་རུངས་པའི་བར་དག་ཆོས་དཀར་པོ་ལ་དགོད་མི་ནུས། བདག་གིས་རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། དགེ་སྦྱོང་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་འཁྲུགས་པ་རྣམས་ཀྱང་སླར་ཞི་བར་བྱ་མི་ནུས། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་འཁྲུགས་པ་ཡང་ཞི་བར་བྱ་མི་ནུས།
en: Nor am I able anymore to quell the disturbed mental states of any kṣatriyas, brahmins, vaiśyas, śūdras, ascetics, men, women, sons, or daughters or the disturbances suffered by villages, towns, cities, countries, or states.

source: བདག་གིས་འབྱུང་པོ་རྣམས་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བ་ཡང་ཕྱིར་ཞིང་རྣམ་པར་ཐར་པའི་རོ་ལ་དགོད་པར་ཡང་མི་ནུས་ཏེ།
en: Nor am I able any longer to instill in the minds and thoughts of beings the fondness for liberation.

source: རིགས་ཀྱི་བུ་གནོད་སྦྱིན་དང་། ལུས་སྲུལ་པོ་ཐམས་ཅད་ཀྱི་སྙིང་ལ་གཡོ་སྦྱོར་བ་མི་དྲང་བའི་ཤེས་པ་ཡང་བདག་གིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཟི་བརྗིད་ཀྱིས་ཤེས་སོ། །རིགས་ཀྱི་བུ་འབྱུང་པོ་རྣམས་ཀྱི་སྙིང་པོ།
en: O noble son, I have thoroughly understood, through the majesty and splendor of the buddhas, the hearts of all the yakṣas and kaṭapūtanas—their treachery and the stratagems they employ.

source: རྡོ་རྗེ་ནམ་མཁའ་རྟོག་འཇུག་ཅེས་བྱ་བའི་རིག་པའི་གསང་སྔགས་ཀྱི་གཟུངས་ཀྱི་ཚིག་དྲག་པ་མི་བཟད་པ་ཆེན་མོ་ཡོད་དེ།
en: “There is, O noble son, a very fierce and terrible dhāraṇī, a mantra of magic called the expanse of the vajra sky , which is the heart essence of all spirits.

source: གསང་སྔགས་ཀྱི་ཚིག་དེ་དག་གིས་བཏབ་ན། གནོད་སྦྱིན་ནམ། གནོད་སྦྱིན་མོའམ། གནོད་སྦྱིན་རྒན་པོའམ།
en: When the words of this dhāraṇī are employed, evil beings will no longer be able to disturb the kṣatriyas, . . .

source: གནོད་སྦྱིན་རྒན་མོའམ། གནོད་སྦྱིན་གྱི་བུའམ། གནོད་སྦྱིན་གྱི་བུ་མོའམ། གནོད་སྦྱིན་གྱི་འཁོར་ཕོའམ། གནོད་སྦྱིན་གྱི་འཁོར་མོའམ།
en: countries, or states—no yakṣa or yakṣiṇī, male or female yakṣa elder, yakṣa son or daughter, yakṣa or yakṣiṇī with a retinue, rākṣasa or rākṣasī, . . .

source: སྲིན་པོའམ། སྲིན་མོའམ། ཀླུ་དང་། ཀླུ་མོ་དང་། གྲུལ་བུམ་དང་། གྲུལ་བུམ་མོ་དང་། བརྗེད་བྱེད་དང་། བརྗེད་བྱེད་མོའི་བར་དང་། ཉིན་གཅིག་པ་དང་། ཉིན་བཞི་པ་ནས་སྲུལ་པོའམ། སྲུལ་མོའམ། ལུས་སྲུལ་པོའམ། ལུས་སྲུལ་མོའམ། ལུས་སྲུལ་རྒན་པོའམ། ལུས་སྲུལ་རྒན་མོའམ། ལུས་སྲུལ་གྱི་བུའམ། ལུས་སྲུལ་གྱི་བུ་མོའམ། ལུས་སྲུལ་གྱི་འཁོར་ཕོའམ། ལུས་སྲུལ་གྱི་འཁོར་མོའི་བར་དག་གིས་ཕྱི་ཕྱིར་ཞིང་རྒྱལ་རིགས་དཀྲུག་པ་ནས། ལྗོངས་ཀྱི་བར་དུ་དཀྲུག་པར་བྱེད་མི་ནུས་སོ།
en: nāga or nāginī, kumbhāṇḍa or kumbhāṇḍī, quotidian through quartan malarial fever-spirits, male or female pūtanas or kaṭapūtanas, male or female kaṭapūtana elders, male or female kaṭapūtana offspring, or male or female kaṭapūtanas with a retinue.

source: །རིགས་ཀྱི་བུ་གྲོང་ངམ། གྲོང་ཁྱེར་རམ།
en: “In any village, town, city, . . .

source: གྲོང་རྡལ་ནས་དམངས་ཀྱི་ཁྱིམ་གྱི་བར་དུ་གང་ན་རྡོ་རྗེ་ནམ་མཁའ་རྟོག་འཇུག་ཅེས་བྱ་བ། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དྲག་པ་མི་བཟད་པ་ཆེན་མོ་རིག་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བཤད་པར་གྱུར་པ་དེར་གནོད་སྦྱིན་དང་། ལུས་སྲུལ་པོ་མ་རུངས་པ་དེ་དག་གིས་སྔོན་ཁོན་དུ་བཟུང་ཞིང་མི་དགེ་བའི་ལས་བྱེད་པ་དེ་དག་ཐམས་ཅད་བཏང་ནས།
en: or household where the mantra words of the expanse of the vajra sky, this very fierce and terrible spell that is the heart essence of all spirits, have been taught, these wicked yakṣas and kaṭapūtanas there will abandon their unwholesome acts and previously held grudges.

source: བྱམས་པ་དང་། སྙིང་རྗེ་དང་། སེམས་འཇམ་པ་དང་། འབྱུང་པོ་ཐམས་ཅད་ལ་སྙིང་རྗེ་དང་ལྡན་པ་དང་། ཕན་པའི་སེམས་སུ་འགྱུར་རོ།
en: They will all develop minds of loving kindness, compassion, gentleness, compassion for all spirits, and benevolence.

source: །ཡུལ་འཁོར་དང་། དམངས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལུས་སྲུལ་པོའི་འཁྲུག་པ་ཐམས་ཅད་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། གཟའ་དང་། རྒྱུ་སྐར་དང་། ཆད་པ་དང་། དུག་དང་། མཚོན་དང་། བྱད་དང་། འཁྲུག་པ་ཐམས་ཅད་དང་། ལུས་ཀྱི་རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། འདུས་པ་དང་། ཉིན་གཅིག་པ་དང་། ཉིན་གཉིས་པ་དང་། ཉིན་གསུམ་པ་དང་། ཉིན་བཞི་པའི་རིམས་དང་། མཛེ་དང་། རྐོང་པ་དང་། གཡན་པ་དང་། ལུད་པ་དང་། འབྲུམ་བུ་དང་། ལྟོ་ན་བ་དང་། ཡན་ལག་ན་བ་དང་། ཉིང་ལག་གི་ནད་དང་། འཁྲུག་པ་དག་ཞི་བར་བྱེད་དེ།
en: They will then quell all the disturbances that affect countries, households, gods, nāgas, yakṣas, and kaṭapūtanas, as well as all those that affect the moon, the sun, the planets, and the constellations. They will terminate punishments, neutralize poisons and weapons, and appease evil spirits. They will heal the bodies affected by imbalances of wind, bile, or phlegm, the malarial fever that lasts for one, two, three, or four days, and leprosy, ringworm, itching, bronchitis, dermatitis, abdominal pain, and diseases of the limbs and digits.
